api-server/app/controllers/api/v1/aircrafts_controller.rb

    def index
      respond_with Aircraft.all
---
SELECT "aircrafts".* FROM "aircrafts"