api-server/app/controllers/api/v1/tests_controller.rb

    def index
      respond_with Test.all
---
SELECT "tests".* FROM "tests"

    def create
      respond_with :api, :v1, Test.create(test_params)
---
INSERT INTO "tests" ("date", "aircraft_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "test"], ["aircraft_id", 1], ["user_id", 1], ["created_at", "2020-04-17 22:50:12.023168"], ["updated_at", "2020-04-17 22:50:12.023168"]]

    def destroy
      respond_with Test.destroy(params[:id])
---
DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 1]]