api-server/app/controllers/api/v1/users_controller.rb

    def index
      respond_with User.all
---
SELECT "users".* FROM "users"

    def create
      respond_with :api, :v1, User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2020-04-17 21:38:27.802333"], ["updated_at", "2020-04-17 21:38:27.802333"]]