app/controllers/api/v1/users_controller.rb

    def index
      respond_with User.all
---
SELECT "users".* FROM "users"

    def create
      respond_with :api, :v1, User.create(user_params)
---
INSERT INTO "users" ("id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 0], ["name", "teste45"], ["created_at", "2020-04-08 20:11:47.448186"], ["updated_at", "2020-04-08 20:11:47.448186"]]